Repository: bigKING67/pi-67-desktop
Catalog: src/Pi67.Desktop.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# OpenWorkspaceButton.Content
source: Open project
zh_cn: 打开项目

# NewSessionButton.Content
source: New session
zh_cn: 新会话

# OpenSessionButton.Content
source: Open selected session
zh_cn: 打开所选会话

# ComposerTextBox.PlaceholderText
source: Describe the task for Pi. Enter sends; Shift+Enter adds a line.
zh_cn: 向 Pi 说明要完成的任务。Enter 发送，Shift+Enter 换行。

# StopButton.Content
source: Stop
zh_cn: 停止

# SendButton.Content
source: Send
zh_cn: 发送

# ActivityTab.Header
source: Activity
zh_cn: 活动

# SettingsTab.Header
source: Settings
zh_cn: 设置

# DiagnosticsTab.Header
source: Diagnostics
zh_cn: 诊断

# TrustOnceButton.Content
source: Trust once
zh_cn: 仅本次信任

# TrustPersistButton.Content
source: Trust and remember
zh_cn: 信任并记住

# DenyTrustButton.Content
source: Deny
zh_cn: 拒绝

# CompactNavigationButton.Content
source: Projects and sessions
zh_cn: 项目与会话

# ContextToggleButton.Content
source: Context
zh_cn: 上下文

# CompactOpenWorkspaceButton.Content
source: Open project
zh_cn: 打开项目

# CompactNewSessionButton.Content
source: New session
zh_cn: 新会话

# CompactOpenSessionButton.Content
source: Open selected session
zh_cn: 打开所选会话

# AttachImageButton.Content
source: Add image
zh_cn: 添加图片

# RemoveAttachmentButton.Content
source: Remove
zh_cn: 移除

# RemoveAttachmentButton.AutomationProperties.Name
source: Remove image attachment
zh_cn: 移除图片附件

# ProjectTrustHeading.Text
source: Project resource trust
zh_cn: 项目资源信任

# AuthenticationHeading.Text
source: Authentication
zh_cn: 认证状态

# ModelsHeading.Text
source: Models
zh_cn: 模型

# OAuthButton.Content
source: OAuth sign-in
zh_cn: OAuth 登录

# LogoutButton.Content
source: Sign out
zh_cn: 退出

# RefreshModelsButton.Content
source: Refresh
zh_cn: 刷新

# SetDefaultModelButton.Content
source: Set default
zh_cn: 设为默认

# RunBootstrapStepButton.Content
source: Run this step
zh_cn: 执行这一步

# CancelBootstrapButton.Content
source: Cancel active step
zh_cn: 取消正在执行的步骤

# ProjectsHeading.Text
source: Projects
zh_cn: 项目

# SessionList.AutomationProperties.Name
source: Pi sessions
zh_cn: Pi 会话

# RuntimeInfoBar.AutomationProperties.Name
source: Pi runtime status
zh_cn: Pi runtime 状态

# TranscriptList.AutomationProperties.Name
source: Conversation transcript
zh_cn: 会话记录

# OperationStatusText.AutomationProperties.Name
source: Current operation status
zh_cn: 当前操作状态

# ToolActivityList.AutomationProperties.Name
source: Tool activity
zh_cn: 工具活动

# Workspace.None
source: No project selected
zh_cn: 未选择项目

# Runtime.Checking
source: Checking Pi runtime
zh_cn: 正在检查 Pi runtime

# Runtime.Verified
source: Pi runtime verified
zh_cn: Pi runtime 已验证

# Runtime.Unverified
source: Pi runtime version unverified
zh_cn: Pi runtime 版本未验证

# Runtime.TooOld
source: Pi runtime is too old
zh_cn: Pi runtime 版本过旧

# Runtime.Unavailable
source: Pi runtime unavailable
zh_cn: Pi runtime 不可用

# Runtime.CheckComplete
source: Environment check complete
zh_cn: 环境检查完成

# Runtime.PreparationRequired
source: Environment preparation required
zh_cn: 需要完成环境准备

# Runtime.CheckFailed
source: Environment check failed
zh_cn: 环境检查失败

# Runtime.CheckRetry
source: Environment state was preserved; retry the check
zh_cn: 环境状态已保留，可重试检查

# Trust.NotSelected
source: No project selected
zh_cn: 尚未选择项目

# Trust.NotTrusted
source: Project resources are not trusted; tool approval remains separate
zh_cn: 项目资源尚未信任；工具审批仍独立生效

# Trust.Once
source: Trust project resources for this process only
zh_cn: 仅本次进程信任项目资源

# Trust.PersistWhenAvailable
source: Trust will be saved when Pi becomes available
zh_cn: 将在 Pi 可用后持久化项目信任

# Trust.DenyResources
source: Do not load project-local Pi resources
zh_cn: 不加载项目本地 Pi 资源

# Trust.Persisted
source: Project resources are persistently trusted; tool approval remains separate
zh_cn: 已持久信任项目资源；工具审批仍独立生效

# Trust.Process
source: Project resources are trusted for this process; tool approval remains separate
zh_cn: 仅本次进程信任项目资源；工具审批仍独立生效

# Trust.Denied
source: Project-local Pi resources were denied
zh_cn: 已拒绝项目本地 Pi 资源

# Trust.RequiresResources
source: The project contains Pi resources that require trust
zh_cn: 项目包含需要信任的 Pi 资源

# Trust.NoResources
source: The project has no Pi resources that require trust
zh_cn: 项目没有需要信任的 Pi 资源

# Operation.Ready
source: Ready
zh_cn: 准备就绪

# Operation.ControlUnavailable
source: Pi settings bridge unavailable
zh_cn: Pi 设置桥接不可用

# Operation.ControlUnavailableDetail
source: Pi settings bridge unavailable: {0}
zh_cn: Pi 设置桥接不可用：{0}

# Operation.BootstrapBusy
source: Another environment step is already running
zh_cn: 另一项环境准备正在运行

# Operation.AwaitingConfirmation
source: Awaiting confirmation: {0}
zh_cn: 等待确认：{0}

# Operation.RunningStep
source: Running: {0}
zh_cn: 正在执行：{0}

# Operation.StepComplete
source: Completed: {0}
zh_cn: 已完成：{0}

# Operation.StepFailed
source: Environment preparation failed: {0}
zh_cn: 环境准备失败：{0}

# Operation.StepCancelled
source: Cancelled: {0}
zh_cn: 已取消：{0}

# Operation.BootstrapCancelled
source: Environment preparation cancelled
zh_cn: 环境准备已取消

# Operation.ShuttingDown
source: Safely closing the Pi RPC session
zh_cn: 正在安全关闭 Pi RPC 会话

# Operation.UnexpectedFailure
source: The operation did not complete; current state was preserved
zh_cn: 操作未完成，当前状态已保留

# Operation.RuntimeRequired
source: Prepare the Pi runtime first
zh_cn: 请先完成 Pi runtime 环境准备

# Operation.WorkspaceRequired
source: Select a project folder first
zh_cn: 请先选择项目文件夹

# Operation.SafetyMissingCreate
source: Desktop safety extension is missing; session was not started
zh_cn: Desktop safety extension 缺失，未启动会话

# Operation.SessionStarted
source: Pi RPC session started
zh_cn: Pi RPC 会话已启动

# Operation.SessionStartFailed
source: Pi RPC failed to start: {0}
zh_cn: Pi RPC 启动失败：{0}

# Operation.RuntimeOrWorkspaceMissing
source: Pi runtime or project is not ready
zh_cn: Pi runtime 或项目尚未准备完成

# Operation.SafetyMissingOpen
source: Desktop safety extension is missing; session was not opened
zh_cn: Desktop safety extension 缺失，未打开会话

# Operation.SessionOpened
source: Opened session: {0}
zh_cn: 已打开会话：{0}

# Operation.SessionOpenedLimited
source: Opened session: {0}; showing the latest {1} messages
zh_cn: 已打开会话：{0}；界面显示最近 {1} 条消息

# Operation.SessionOpenFailed
source: Failed to open Pi session: {0}
zh_cn: 打开 Pi 会话失败：{0}

# Operation.ImageDuringFollowUp
source: Images cannot be added to a follow-up while Pi is running; stop or wait for the current task
zh_cn: Pi 正在运行时不能把图片加入 follow-up；请停止或等待当前任务完成

# Operation.PromptAccepted
source: Prompt sent to Pi
zh_cn: 提示已交给 Pi

# Operation.PromptRejected
source: Pi rejected the prompt: {0}
zh_cn: Pi 拒绝提示：{0}

# Operation.SendCancelled
source: Send cancelled; input was preserved
zh_cn: 发送已取消，输入内容已保留

# Operation.SendFailed
source: Send failed; input was preserved: {0}
zh_cn: 发送失败，输入内容已保留：{0}

# Operation.StopRequested
source: Requested Pi to stop the current operation
zh_cn: 已请求停止当前 Pi 操作

# Operation.ApiKeySaved
source: Saved the {0} API key; its value is never displayed or logged
zh_cn: 已保存 {0} API key；密钥值不会显示或写入日志

# Operation.LoggedOut
source: Signed out of {0}
zh_cn: 已退出 {0}

# Operation.OAuthCancelled
source: Cancelled {0} OAuth sign-in
zh_cn: 已取消 {0} OAuth 登录

# Operation.OAuthComplete
source: {0} OAuth sign-in completed
zh_cn: {0} OAuth 登录已完成

# Operation.DefaultModelUpdated
source: Default model set to {0}
zh_cn: 默认模型已设为 {0}

# Operation.ModelsRefreshed
source: Model list refreshed
zh_cn: 模型列表已刷新

# Operation.AgentComplete
source: Pi completed the current task
zh_cn: Pi 已完成当前任务

# Operation.ExtensionError
source: A Pi extension reported an error; session state was preserved
zh_cn: Pi extension 报告错误；会话状态已保留

# Operation.EventStreamStopped
source: Pi RPC event stream stopped; the session was not marked complete: {0}
zh_cn: Pi RPC 事件流已停止；会话未标记完成：{0}

# Operation.ExtensionNotice
source: Pi extension notification
zh_cn: Pi extension 通知

# Bootstrap.git.Name
source: Install Git
zh_cn: 安装 Git

# Bootstrap.git.Description
source: Git for Windows is required for workspace and pi-67 source operations.
zh_cn: 工作区与 pi-67 源码操作需要 Git for Windows。

# Bootstrap.node.Name
source: Install Node.js 24 LTS
zh_cn: 安装 Node.js 24 LTS

# Bootstrap.node.Description
source: Runs the real Pi package and Desktop control bridge.
zh_cn: 用于运行真实 Pi package 与 Desktop 控制桥接。

# Bootstrap.pi.Name
source: Install upstream Pi
zh_cn: 安装 upstream Pi

# Bootstrap.pi.Description
source: Provides the only agent runtime used by Desktop.
zh_cn: 提供 Desktop 使用的唯一 Agent runtime。

# Bootstrap.pi67-manager.Name
source: Install pi-67 manager
zh_cn: 安装 pi-67 manager

# Bootstrap.pi67-manager.Description
source: Provides supported pi-67 install, doctor, and update workflows.
zh_cn: 提供受支持的 pi-67 安装、诊断和更新流程。

# Bootstrap.pi67-distro.Name
source: Install pi-67 distro
zh_cn: 安装 pi-67 distro

# Bootstrap.pi67-distro.Description
source: Creates the managed Pi agent checkout without overwriting existing data.
zh_cn: 创建托管的 Pi agent checkout，不覆盖既有数据。

# Model.NotRead
source: Default model has not been read
zh_cn: 尚未读取默认模型

# Model.NotSelected
source: No default model selected
zh_cn: 尚未选择默认模型

# Model.Default
source: Default: {0}
zh_cn: 默认：{0}

# Auth.NotConfigured
source: Not configured
zh_cn: 未配置

# Transcript.User
source: You
zh_cn: 你

# Transcript.Attachments
source: Attachments: {0}
zh_cn: 附件：{0}

# Tool.ParametersHidden
source: Parameters are hidden
zh_cn: 参数未显示

# Tool.SensitiveHidden
source: Sensitive or raw parameters are hidden
zh_cn: 敏感或原始参数已隐藏

# Tool.Running
source: Running
zh_cn: 运行中

# Tool.Failed
source: Failed
zh_cn: 失败

# Tool.Complete
source: Complete
zh_cn: 完成

# Extension.RequestTitle
source: Pi request
zh_cn: Pi 请求

# Dialog.ImageErrorTitle
source: Could not add image
zh_cn: 无法添加图片

# Dialog.ImageSizeError
source: Each image must be between 1 byte and 10 MB.
zh_cn: 每张图片必须在 1 字节到 10 MB 之间。

# Dialog.ManualReviewTitle
source: Manual review required
zh_cn: 需要人工检查

# Dialog.Source
source: Source: {0}
zh_cn: 来源：{0}

# Dialog.GeneratedCommand
source: The built-in bootstrapper will generate the command at execution time.
zh_cn: 命令将在执行时由内置引导器生成。

# Dialog.ConfirmStep
source: Confirm and run this step
zh_cn: 确认并执行这一步

# Dialog.Cancel
source: Cancel
zh_cn: 取消

# Dialog.ApiKeyTitle
source: Set {0} API key
zh_cn: 设置 {0} API key

# Dialog.Save
source: Save
zh_cn: 保存

# Dialog.OAuthFailedTitle
source: OAuth sign-in did not complete
zh_cn: OAuth 登录未完成

# Dialog.OperationFailedTitle
source: Operation did not complete
zh_cn: 操作未完成

# Dialog.OperationFailedMessage
source: The current state was preserved. Check the Pi runtime status and try again.
zh_cn: 当前状态已保留。请检查 Pi 运行状态后重试。

# Dialog.ExternalLinkTitle
source: Open external link
zh_cn: 打开外部链接

# Dialog.ExternalLinkMessage
source: This action opens the following address in the default browser:
zh_cn: 此操作会在默认浏览器中打开以下地址：

# Dialog.OpenLink
source: Allow this open
zh_cn: 允许本次打开

# Dialog.Deny
source: Deny
zh_cn: 拒绝

# Dialog.AllowOnce
source: Allow this command once
zh_cn: 允许本次命令

# Dialog.Select
source: Select
zh_cn: 选择

# Dialog.Submit
source: Submit
zh_cn: 提交

# Dialog.OAuthTitle
source: OAuth sign-in
zh_cn: OAuth 登录

# Dialog.Continue
source: Continue
zh_cn: 继续

# Dialog.Close
source: Close
zh_cn: 关闭
